dataset/training/sample_001_request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <InsertUpdateKYCRecord xmlns="https://pancheck.www.kracvl.com">
      <webApi>
        <inputXml>
          <![CDATA[
<ROOT>
  <HEADER>
    <COMPANY_CODE>1500000021</COMPANY_CODE>
    <BATCH_DATE>24/12/2025</BATCH_DATE>
  </HEADER>
  <KYCDATA>
    <APP_UPDTFLG>99</APP_UPDTFLG>
    <APP_KRA_CODE>NDML</APP_KRA_CODE>
    <APP_POS_CODE>1500000021</APP_POS_CODE>
    <APP_TYPE>I</APP_TYPE>
    <APP_NO>100709_0</APP_NO>
    <APP_DATE>24/12/2025</APP_DATE>
    <APP_PAN_NO>INVALIDPAN</APP_PAN_NO>
    <APP_PAN_COPY>Y</APP_PAN_COPY>
    <APP_EXMT>N</APP_EXMT>
    <APP_EXMT_CAT />
    <APP_EXMT_ID_PROOF>03</APP_EXMT_ID_PROOF>
    <APP_IPV_FLAG>E</APP_IPV_FLAG>
    <APP_IPV_DATE />
    <APP_GEN>M</APP_GEN>
    <APP_NAME>PANKAJ R DERE</APP_NAME>
    <APP_F_NAME>RAMESH SHRAVAN DERE</APP_F_NAME>
    <APP_REGNO />
    <APP_DOB_INCORP>22/05/1983</APP_DOB_INCORP>
    <APP_COMMENCE_DT />
    <APP_NATIONALITY>01</APP_NATIONALITY>
    <APP_OTH_NATIONALITY />
    <APP_COMP_STATUS />
    <APP_OTH_COMP_STATUS />
    <APP_RES_STATUS>N</APP_RES_STATUS>
    <APP_RES_STATUS_PROOF>01</APP_RES_STATUS_PROOF>
    <APP_UID_NO>1687</APP_UID_NO>
    <APP_COR_ADD1>B401 Pandurang Tower</APP_COR_ADD1>
    <APP_COR_ADD2>Ganesh Nagar, Dombivli West Kalyan </APP_COR_ADD2>
    <APP_COR_ADD3>Opposite Raj Vaibhav Complex</APP_COR_ADD3>
    <APP_COR_CITY>Thane</APP_COR_CITY>
    <APP_COR_PINCD>421202</APP_COR_PINCD>
    <APP_COR_STATE>027</APP_COR_STATE>
    <APP_COR_CTRY>101</APP_COR_CTRY>
    <APP_OFF_ISD />
    <APP_OFF_STD />
    <APP_OFF_NO />
    <APP_RES_ISD />
    <APP_RES_STD />
    <APP_RES_NO />
    <APP_MOB_ISD>91</APP_MOB_ISD>
    <APP_MOB_NO>9702744798</APP_MOB_NO>
    <APP_FAX_ISD />
    <APP_FAX_STD />
    <APP_FAX_NO />
    <APP_EMAIL>PANKAJRDERE@GMAIL.COM</APP_EMAIL>
    <APP_COR_ADD_PROOF>31</APP_COR_ADD_PROOF>
    <APP_COR_ADD_REF>1687</APP_COR_ADD_REF>
    <APP_COR_ADD_DT />
    <APP_PER_ADD_FLAG>N</APP_PER_ADD_FLAG>
    <APP_PER_ADD1>28 650 SOI VILLAGE BUILDING SUPALAI</APP_PER_ADD1>
    <APP_PER_ADD2>WELLINGTON TOWER 6 FLOOR 14 </APP_PER_ADD2>
    <APP_PER_ADD3>ROOM 650 THIAM RUAM MIT ROAD HUAI KHWANG 10310</APP_PER_ADD3>
    <APP_PER_CITY>BANGKOK</APP_PER_CITY>
    <APP_PER_PINCD>000000</APP_PER_PINCD>
    <APP_PER_STATE>BANGKOK</APP_PER_STATE>
    <APP_PER_CTRY>215</APP_PER_CTRY>
    <APP_PER_ADD_PROOF>27</APP_PER_ADD_PROOF>
    <APP_PER_ADD_REF>3024556729103015927</APP_PER_ADD_REF>
    <APP_PER_ADD_DT />
    <APP_INCOME>05</APP_INCOME>
    <APP_OCC>02</APP_OCC>
    <APP_OTH_OCC />
    <APP_POL_CONN>NA</APP_POL_CONN>
    <APP_DOC_PROOF>S</APP_DOC_PROOF>
    <APP_INTERNAL_REF>2025122417414415</APP_INTERNAL_REF>
    <APP_BRANCH_CODE>HEADOFFICE</APP_BRANCH_CODE>
    <APP_MAR_STATUS>01</APP_MAR_STATUS>
    <APP_NETWRTH />
    <APP_NETWORTH_DT />
    <APP_INCORP_PLC />
    <APP_OTHERINFO />
    <APP_FILLER1 />
    <APP_FILLER2 />
    <APP_FILLER3 />
    <APP_IPV_NAME>Kiran Vilas Khaire</APP_IPV_NAME>
    <APP_IPV_DESG>Head Office User</APP_IPV_DESG>
    <APP_IPV_ORGAN>SAPIENT FINSERV PRIV</APP_IPV_ORGAN>
    <APP_KYC_MODE>5</APP_KYC_MODE>
    <APP_ACC_OPENDT />
    <APP_ACC_ACTIVEDT />
    <APP_ACC_UPDTDT />
    <APP_VID_NO />
    <APP_UID_TOKEN />
    <APP_VER_NO>V29</APP_VER_NO>
    <APP_AUTH_NAME />
    <APP_AUTH_EMAIL />
    <APP_AUTH_EMAIL1 />
    <APP_AUTH_EMAIL2 />
    <APP_AUTH_MOBILE />
    <APP_AUTH_FPICONSENT />
    <APP_AUTH_UBOCONSENT />
    <APP_MOBILE_FLG />
    <APP_EMAIL_FLG />
    <APP_OTP_REFNO />
    <APP_PERM_DISTRICT />
    <APP_CORR_DISTRICT>474</APP_CORR_DISTRICT>
    <APP_FATCA_APPLICABLE_FLAG>Y</APP_FATCA_APPLICABLE_FLAG>
    <APP_FATCA_BIRTH_PLACE>MAHARASHTRA</APP_FATCA_BIRTH_PLACE>
    <APP_FATCA_BIRTH_COUNTRY>IN</APP_FATCA_BIRTH_COUNTRY>
    <APP_FATCA_COUNTRY_CITYZENSHIP>IN</APP_FATCA_COUNTRY_CITYZENSHIP>
    <APP_FATCA_DATE_DECLARATION>24/12/2025</APP_FATCA_DATE_DECLARATION>
  </KYCDATA>
  <FATCA_ADDL_DTLS>
    <APP_FATCA_ENTITY_PAN>INVALIDPAN</APP_FATCA_ENTITY_PAN>
    <APP_FATCA_COUNTRY_RESIDENCY>TH</APP_FATCA_COUNTRY_RESIDENCY>
    <APP_FATCA_TAX_IDENTIFICATION_NO>3024556729103015927</APP_FATCA_TAX_IDENTIFICATION_NO>
    <APP_FATCA_TAX_EXEMPT_FLAG>N</APP_FATCA_TAX_EXEMPT_FLAG>
    <APP_FATCA_TAX_EXEMPT_REASON />
  </FATCA_ADDL_DTLS>
  <FOOTER>
    <NO_OF_KYC_RECORDS>1</NO_OF_KYC_RECORDS>
    <NO_OF_ADDLDATA_RECORDS />
    <NO_OF_FATCA_ADDL_DTLS_RECORDS>1</NO_OF_FATCA_ADDL_DTLS_RECORDS>
  </FOOTER>
</ROOT>
]]>
        </inputXml>
        <pan>INVALIDPAN</pan>
        <userName>CVL_MFU</userName>
        <posCode>1500000021</posCode>
        <password>NhCMnZ2AIWCUwWbF8vkYuQ!3d!3d</password>
        <passKey>ed9094b83db04ac18940b5170a02ce24</passKey>
      </webApi>
    </InsertUpdateKYCRecord>
  </Body>
</Envelope>
